# FittingAngleUsage Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeSettings..::..FittingAngleUsage Property
PipeSettings Class See Also
---
Determine how to use fitting angle during pipe layout or modifying layout.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FittingAngleUsage FittingAngleUsage { get; set; }
```

Visual Basic
---
```text
Public Property FittingAngleUsage As FittingAngleUsage
	Get
	Set
```

Visual C++
---
```text
public:
property FittingAngleUsage FittingAngleUsage {
	FittingAngleUsage get ();
	void set (FittingAngleUsage value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for fittingAngleUsage doesn't support in piping. -or- When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace